//*********************************************************/            00050000
//*                                                       */            00100000
//*     $MAC(BPXOINIT) COMP(SCPX1) PROD(BPX):             */            00150000
//*                                                       */            00200000
//* INIT PROCESS STARTUP PROCEDURE                        */            00250000
//*                                                       */            00253800
//*********************************************************/            00500000
//BPXOINIT PROC                                                         00550000
//BPXOINIT EXEC PGM=BPXPINPR,REGION=0K,TIME=NOLIMIT                     00600000
