//DEALLOC EXEC PGM=IEFBR14                                              03000003
//DUMMY1  DD   DUMMY                                                    03050000
//* THIS PROCEDURE IS ACTIVATED BY A 'START DEALLOC' COMMAND TO         06000003
//* EXECUTE IEFBR14 CAUSING ALLOCATION TO DEALLOCATE A                  09000003
//* DEVICE SPECIFIED ON A PREVIOUS 'VARY OFFLINE' COMMAND.              12000003
