//*******************************************************************   00050000
//*      THIS PROC IS USED TO START THE DLF ADDRESS SPACE           *   00100000
//*******************************************************************   00150000
//DLF      PROC  NN=00                                                  00200000
//DLF      EXEC  PGM=COFMISDO,PARM='NN=&NN'                             00250000
