//IEESYSAS PROC PROG=IEFBR14                                            00050000
//IEFPROC  EXEC PGM=&PROG                                               00100000
//* THE IEESYSAS PROCEDURE IS SPECIFIED IN THE                          00150000
//* PARAMETER LIST TO IEEMB881 BY MVS COMPONENTS                        00200000
//* STARTING FULL FUNCTION SYSTEM ADDRESS SPACES.                       00250000
