//LINKS  PROC                                                           00050000
//LK EXEC PGM=HEWLH096,REGION=2048K,COND=(8,LT)                    @L1C 00100000
//SYSUT1 DD DISP=(NEW,DELETE),DSNAME=&&SYSUT1,SPACE=(1700,(400,50)),   X00150000
//      UNIT=SYSDA                                                      00200000
//SYSPRINT DD SPACE=(121,(850,50),RLSE),                               X00250000
//    DCB=(RECFM=FB,LRECL=121,BLKSIZE=1210),SYSOUT=&CLASS               00300000
//SYSPUNCH DD DISP=SHR,VOLUME=(,RETAIN),DSNAME=SYS1.&OBJ                00350000
//SYSLMOD DD DISP=OLD,UNIT=&UNIT,VOL=SER=&SER,                         X00400000
//    DSNAME=&N..&NAME&P1&MOD&P2                                        00450000
