//*******************************************************************   00050000
//*      THIS PROC IS USED TO START THE VIRTUAL LOOKASIDE FACILITY  *   00100000
//*      ADDRESS SPACE.                                             *   00150000
//*******************************************************************   00200000
//VLF      PROC  NN=00                                                  00250000
//VLF      EXEC  PGM=COFMINIT,PARM='NN=&NN'                             00300000
