PROC 0 DEBUG
IF &DEBUG = DEBUG THEN CONTROL CONLIST SYMLIST NOFLUSH
WRITE &ZUSER
WRITE &ZOS390RL
WRITE &ZISPFOS
ISPEXEC VGET (ZUSER ZOS390RL ZISPFOS) ASIS
WRITE USER: &ZUSER
WRITE   OS: &ZOS390RL
WRITE ISPF: &ZISPFOS
WRITE
ISPVCALL STATUS
EXIT
